#1. შექმენით სია, 
# სადაც გექნებათ სიტყვები, შემდეგ გამოიტანეთ სათითაოდ ყველა სიტყვა.

#2. შექმენით სია, 
# სადაც გექნებათ 5 ცალი რიცხვი, შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი.

#3. შექმენით სია, სადაც გექნებათ` 5 ცალი რიცხვი, 
# შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი გამრავლებული თავის თავზე.

#4. შექმენით სია, 
# სადაც გექნებათ 5 ცალი რიცხვი, 
# შემდეგ ეს ციფრები გააორმაგეთ და დაამატეთ ახალ სიაში.

#1

list1={'alex', 'anna', 'kira', 'ksenia'}

for name in list1:
    print(name)

#2

list2={8,90,78,67,56}

for number in list2:
    print(number)

#3

list3={78,89,56,45,34}

for numbers in list3:
    print(numbers*numbers)

#4

list4=[56,78,67,34,23]
for numbers in list4:
    number_multiply=numbers*2

numbers= 112, 156, 134, 68, 46
list5=[]
list5.append(numbers)
print(list5)
    

